let images = [
"random_select/images/photo1.png",
"random_select/images/photo2.png",
"random_select/images/photo3.png",
"random_select/images/photo4.png",
"random_select/images/photo5.png",
"random_select/images/photo6.png",
"random_select/images/photo7.png",
"random_select/images/photo8.png",
"random_select/images/photo9.png",
"random_select/images/photo10.png",
"random_select/images/photo11.png",
"random_select/images/photo12.png"
];

let startext = [
"要說最勤勞、肯吃苦白羊座絕對不是第一名，但他們有的是沖勁，永遠有用不完的精力。對于白羊來說最適合他的致富方式就是多接兼職工作，而且白羊對金錢十分敏感，通常兼職都是工作時間較短，報酬又較高，還能積聚不少的人脈，拓寬人際關系。",
"金牛座為人吃苦耐勞，職場耕耘是最適合他們的致富方式。金牛有耐心、穩重，對于自己的工作十分上心，一旦工作起來就全身心投入，盡全力把事情做到最好。金牛這種職場工作者也是最讓老板喜愛的，只要金牛能夠兢兢業業，發揮自己的長處，必定有一番作為。",
"雙子座聰穎機智，能言善辯，善于變現自己，他們相當有才能，但是苦于才能總是發揮在不得當的地方，白白浪費，因而總是毫無作為。其實雙子應該根據自身的優勢尋找更好的機遇，特別是在上級面前盡可能多多表現自己，才有可能讓你有更好的出路。" ,
"巨蟹座雖然不是聰明人，但是非常好學，對任何的新知識都十分有興趣，吸收能力相當強。對于如此好學愿意接受新知識的你來說要懂得學以致用，把知識運用在得當的地方，最大可能得發揮你的技能，對你的未來致富道路有莫大的幫助。" ,
"獅子座天生就有著一股王者風范，是為領導者的材料。他們雖然脾氣有點暴躁，但有著清晰的頭腦，能夠理性分析問題，有主見，獅子可以選擇投資商鋪。利用自己的長項，根據自己對市場的了解進行投資，相信獅子一定能夠快速致富。",
"處女座做事一絲不茍、要求苛刻、理智冷靜，這種性格的人最適合他們的致富方式就是：股票！炒股這種高回報高風險的投資絕對不是說有錢就行，必須對股市有所了解，懂得篩選正確的資訊，還要不貪心知進退，這樣才能成為贏家。對于處女座來說進軍股市是一個不錯的選擇。",
"天秤座應酬能力高超，擅長處理人際關系，他們的人脈十分強大，對于你們來說做生意是不錯致富方式。天秤為人公平公正，懂得與人相處之道，再加上廣泛的人脈，進軍商界絕對是不成問題的。或許可以找到志同道合的朋友一起合作也是很好的選擇。" ,
"天蝎座為人比較冷淡、少言，總是喜歡把事情放在心里，可他們卻有著強大地意志力，決定了的事情必定要走到最后。神秘的玄學是讓你們致富的不錯的選擇，你們在讀懂人心方面有不錯的天賦，可以嘗試看看。",
"射手座自由自在、周游列國，因此見多識廣，他們聰明機靈，頭腦靈活，創意無限。想要致富可以發揮自己的潛能，無論是自己開公司還是與人合作出售創意都有很好的成效，能為你進賬不少。但要謹記要時常更新自己的知識庫，求新求變，才會有無窮無盡的新創意。" ,
"摩羯座為人成熟穩重，做事謹慎，永遠不打沒把握的仗。最適合你的致富方式是期貨投資，摩羯做事一向是先做好事前準備，分析資訊狀況，定好計劃才行動，他們又有著果斷的決策能力，對于這種投資相信定能讓摩羯成功致富。",
"水瓶座思想古靈精怪，思想天馬行空，創意無限，但是這種新奇新穎的想法總是讓人不太能夠接受。假如瓶子能夠將這種優勢放進自己的商業模式里面的話，就大有作為了，可以選擇開一個自己的風格小店，加上自己的創意思想，一定經營得有聲有色。",
"雙魚座脾氣溫和、性格溫柔，開淘寶店是最適合你了。但是剛開始的時候要從小做起，別把目標定得太高，還要注意進貨的價效比，找尋品質上乘的貨品，加上你們耐心的服務態度，相信很快就能賺得良好地信譽，生意越做越大。"  
];
