//other
$(function() {  
    $('#dt1').html("牡羊座個性急切，做事講求效率，行動力十足，說做就做，創造性佳，但有時做事三分鐘熱度、缺乏耐性，且過於衝動，容易讓人產生欠缺思慮的不良印象。");  
    $('#dt2').html("金牛個性趨於保守、務實且傳統。生活較重視物質層面，做事刻苦耐勞，耐力過人。不過有時會給人固執不知變通、做事刻板的感覺，甚至可能有物慾的傾象。"); 
    $('#dt3').html("具有人雙子座個性具洞悉情勢、善於溝通、機智過人、應變能力強的特質，做事不夠專注，喜愛談論八卦，甚至膚淺的印象。際溝通以及社交關係的聰慧能力"); 
    $('#dt4').html("巨蟹座個性偏好在固定範疇內行事以求得保護與安全感，常是家庭的守護者，家庭意識深厚，若無法受到保護與慰藉時，排外性、防衛心、退縮閉塞的特質。"); 
    $('#dt5').html("獅子座個性較為自我，喜愛成為團體的中心或焦點，自尊心強烈，具有領導潛能與優越感，為了吸引它人目光，有時容易過度表現、行為誇張。"); 
    $('#dt6').html("處女座個性善於分析整理、識人之明、個性細膩，並追求完美，但當面對無法解構渾沌無規則可循的事物時，常顯現神經質與嘮叨不休的個性。"); 
    $('#dt7').html("天秤座個性對任何事物抱持著平衡的態度，性格著重公平客觀，對藝術有良好鑑賞力，但有時為取得平衡，容易表現出優柔寡斷的負面形象。"); 
    $('#dt8').html("天蠍座個性善於守密，個性沈穩，意志力堅強，深謀遠慮，天蠍座也很容易多疑，善妒，佔有慾強，報復心重，甚至有時會有縱慾的傾向。"); 
    $('#dt9').html("射手座個性喜愛思考探索與追尋哲理，個性樂觀，富理想，好自由，有時常粗心大意，一副無所謂的樣子，甚至有時會有過度樂觀的傾向。"); 
    $('#dt10').html("魔羯座個性具有堅毅的耐力，務實的態度，作事一步一腳印，個性嚴謹、守紀律，有時會表現出冷漠、憂鬱、悲觀、壓抑、欠缺浪漫與不易溝通的特質。"); 
    $('#dt11').html("水瓶座個性獨立且自主，富有創意與研究精神，但有時因想法標新立異、顛覆傳統，不容易與人群融合，會給人一種獨行俠或不合群的印象。"); 
    $('#dt12').html("雙魚座個性包容力強，富有直覺，悲天憫人，容易與人相處，但有時作事缺乏原則，容易受騙上當，甚至有時會有自我催眠或自我欺騙的負面傾向。"); 
  });

$(function() {  
    $('#h2_1').html("牡羊座"); 
    $('#h2_2').html("金牛座"); 
    $('#h2_3').html("雙子座"); 
    $('#h2_4').html("巨蟹座"); 
    $('#h2_5').html("獅子座"); 
    $('#h2_6').html("處女座"); 
    $('#h2_7').html("天坪座"); 
    $('#h2_8').html("天蠍座"); 
    $('#h2_9').html("射手座");
    $('#h2_10').html("魔羯座");  
    $('#h2_11').html("水瓶座");
    $('#h2_12').html("雙魚座"); 
  });  
//gallery  
$(function() {  
    $('#h3_1').html("第一名 天蠍座：翻轉土逆 85 分");
    $('#h3_2').html("第二名 處女座：翻轉土逆 80 分");
    $('#h3_3').html("第三名 金牛座：翻轉土逆 75 分");
  });  
$(function() {  
    $('#ga_1').html("相信直覺、面對內心不安，就是收獲的開始，天蠍在土逆期間，會不斷檢視自己是誰、目前的專業夠不夠、投資方向對不對，但天蠍們做就對了，多多尋問身旁的專業人士，能獲得不錯的建議。投資也是，相信自己的直覺，做了就會有不同的回應，讓天蠍更確定自己的方向。");
    $('#ga_2').html("縱使失去，但更能聚焦自己要的是什麼，處女在工作上千方百計想要證明自我，卻越搞越累，但處女在這次土逆要記得，雖然在工作或投資上有些問題發生，甚至會失去些什麼，但都在幫處女刪減不需要的工作跟投資，幫自己聚焦在對的地方，提升賺錢機會與自我價值。");
    $('#ga_3').html("突破現況開始創新，財運就會降臨，金牛在這次土逆，真的要開始展開新的冒險跟嘗試了，不過，守舊的金牛可能會不斷思考下一步，建議金牛破除舊方法，接納全新的想法，剛開始不被認同會感到孤單，但土逆結束後，財運上會有新的開始跟收入。");
  }); 
//clothes
$(function() {  
  $('#clo_1').html("粉紅色是今年的幸運顏色，衣著要以女性化為主，突顯有女人味的一面。所以除了粉色系色調外，連身裙、性感外穿內衣加外套、絲質恤衫等，只要展露女性優美的一面，再加一雙高跟鞋，都是很有魅力。");
  $('#clo_2').html("個性有很多種，活潑、斯文、好動、單純、沉默寡言、爽朗、多愁善感等，就從性格去入手，以衣著打扮來表達自己是一個怎樣的人，將喜歡的風格成為主軸。");
  $('#clo_3').html("性感神秘的打扮會是新一年的幸運衣著，性感的定義可以有很多，並不代表著得越少布越好，反而是將女性的線條美展露出來，更有魅力。質料可以是蕾絲或較薄紗的，雖然幸運色是橙色及鮮艷的顏色。");
  $('#clo_4').html("自信的穿搭，就是不盲目追隨潮流，穿上身的衣服都是令你舒服開心的，要多試試不同的配搭來襯托出個人風格。所以幸運色是紅色，質料可以更較挻身，雖然是有點搶眼，但能夠一試。");
  $('#clo_5').html("愛惹人注目的獅子座，千萬不要標奇立異去突出自己，始終屬於創作型的你，要突顯個性總有很多方法，鬆身潔淨的衣著打扮讓你身心都感到舒適，白色有令你感到平靜及無受污染般。");
  $('#clo_6').html("一向衣著都較為保守的處女座，繼續按你的衣著品味去選擇，但就不要有太多黑色或灰色，欠缺生氣；耀眼的顏色是有幫助的。此外心形圖案可以今年的幸運花紋，再多配搭一些心形的配件如腰帶領巾等。");
  $('#clo_7').html("雙腳要爪緊大地，才能夠屹立不倒。建議選擇森林系服飾，以天然、低碳、簡潔、隨意等元素為主軸，穿著較窄身的上身，相反下身可以是鬆身的，凝造出上輕下重的感覺，簡單不造作不突出。");
  $('#clo_8').html("紫色會是幸運顏色，想有文學氣息，恤衫、衛衣、牛仔褲就是你的優閒服選擇，再配上單肩包或手提電腦，予人一種單純、清新及有親和力的感覺，不要揀那些太老成的設計。");
  $('#clo_9').html("魅力可以好簡單，如復古洋裝、大蓬袖上衣配短褲、素色衣服配鮮色手袋襪子等。有兩個顏色可以多穿，藍色或白色，亦可以花多些心思在服飾配搭或飾物，尤其是頸部的裝飾。");
  $('#clo_10').html("需要找到工作及個人生活平衡的一年，嘗試在對比顏色或設計上下點功夫，有幸運星的支持，可以多選擇一些深色系以外的顏色，例如紫搭黃，又或者紅配藍，吸引別人的注意力到你身上。");
  $('#clo_11').html("發揮你的想像力，要跟花草樹木做好朋友，紫色是主調顏色。可以選擇植物的圖案，物料是天然無害的，提升身體的觸覺，亦不要被太多緊身的衣服局限你去感受跟外在世界的連結。");
  $('#clo_12').html("配搭可以是鬆身的下身配以短外套或高領上衣，波鞋或平底鞋都可以，再配上時尚皮帶或大耳環，令人耳目一新，黃色是你的幸運顏色，或者再配搭其他淺色系的顏色，都可帶來平靜愉悅的感覺。");
}); 
//numeral 
$(function() {  
  $('#h2_1a').html("3、7、22"); 
  $('#h2_2a').html("1、18、19"); 
  $('#h2_3a').html("2、11、18"); 
  $('#h2_4a').html("6、20、33"); 
  $('#h2_5a').html("1、8、17"); 
  $('#h2_6a').html("3、6、11"); 
  $('#h2_7a').html("4、13、22"); 
  $('#h2_8a').html("9、18、27"); 
  $('#h2_9a').html("8、11、19");
  $('#h2_10a').html("5、14、25");  
  $('#h2_11a').html("7、9、18");
  $('#h2_12a').html("1、7、10"); 
}); 
$(function() {  
  $('#nu_1').html("一向在關係上都較主導的你，要懂得看別人眉頭眼額，嘗試多留意身邊出現的人所為你帶來的影響力，是你的就是你的，不是你的就要放手。幸運數字是3、7、22，顏色是粉紅色或紫色。"); 
  $('#nu_2').html("成功背後不一定要擁有很多財富，能夠做自己才是最幸福。1、18、19會是你的幸運數字，而綠色及淺黃色會是新一年的幸運顏色。"); 
  $('#nu_3').html("嘗試多從別人的身上去學習你沒有的優點，保持謙卑，有需要改變自己時，也就去改變。幸運數字是2、11、18，顏色會是橙色及綠色。"); 
  $('#nu_4').html("建立屬於你的人際網絡，當能夠成為一個為自己負責任的人，真正屬於你的結果即將出現。幸運數字是6、20、33，顏色會是紅色及靛藍色"); 
  $('#nu_5').html("不要怕辛苦，要再過多一年才能夠跳出勞碌的生活，所以還需要以正面的態度去面對，吃有益的及多做運動，要跟健康的身體做好朋友。幸運數字是1、8、17，顏色是白色及珍珠色。"); 
  $('#nu_6').html("在投資方面是有一點運氣，但相對下努力得回來的結果才是最永恆的，你要知道所有事情都要取得平衡，才是最穩固。幸運數字是3、6及11，顏色會是橙色或黃色。"); 
  $('#nu_7').html("發揮更多創意，因為這樣才能夠突出你的與眾不同，不要再只討好身邊的人，要成為最真實的你，才會得到自由。幸運數字是4、13、22，顏色是黑色或啡色。"); 
  $('#nu_8').html("縱使感情關係上有什麼變化，也不要想得負面，因為舊有不適合你的人或事要離去，才有空間讓新的開始出現。幸運數字是9、18、27，顏色是紫色或金色。"); 
  $('#nu_9').html("今年有些事情的發生，會驅使你去改變，但一切都是要考驗你的自信，相信自己有多少價值，來決定結果。幸運數字是8、11、19，顏色是白色或藍色。2"); 
  $('#nu_10').html("做一個開心的人，比做一個悲觀的人更有運氣，既然有能力吸引好的事情來發生，那就只做你想做的事了。幸運數字是5、14、25，顏色是藍色和黑加白色。"); 
  $('#nu_11').html("不要投訴這個世界是不公平的，因為路是要靠自己行出來的，這一年是要默默付出的一年。幸運數字是7、9、18，顏色是綠色和紫色。2"); 
  $('#nu_12').html("要對前景有信心，嘗試學習抽離情緒的方式去思考，這對雙魚座雖然是有點難，我們就是要讓自己跟別人不一樣，突出自己。幸運數字是1、7、10，顏色是紅色或黃色。"); 
}); 
//index
$(function() {  
  $('#in_1').html("人靠衣裝，彿靠金裝，打扮得體運氣自然來。來了解於2020年怎麼樣的衣著最能令你幸運爆錶！"); 
  $('#in_2').html("每個人都總有幾個特別喜歡的數字和顏色。但是，你喜歡它，不代表他會因而帶給你好運。十二星座帶來運氣的數字與顏色，不妨來看看它們是不是你喜歡的數字和顏色。"); 
  $('#in_3').html("2019的你運氣好嗎？好的話便把運氣帶到新一年；不好的話便看看2020年有些什麼幸運之物能給你帶來好運氣吧！"); 
});  
$(function() {  
  $('#h1_1').html("帶你星空漫遊 探索十二星座奧秘");
  $('#h1_2').html("星星所守護的星座");
  $('#h1_3').html("2020 超前部署！這三個星座土逆意外好運");
});  
$(function() {  
  $('#h1p_1').html("星座的傳說、占星術都是很早之前就存在的，古老的發明如今瘋狂流行，恰恰印證了星座也是影響人們性格特點的重要因素。");
  $('#h1p_2').html("這一個小宇宙中找到屬於自己的星星，並以每一個星宿所代表的意義與故事去表達出真正的自己。");
  $('#h1p_3').html("每個人都有一個決定性格與天賦的星盤，但主宰人生的依舊是自己，而非命運");
}); 
$(function() {  
  $('#a_1').html("....現在就仔細看吧!");
  $('#a_2').html("....是誰在守護您呢?");
  $('#a_3').html("....快看是哪個星座!");
}); 
$(function() {  
  $('#as_1').html("跟著流行時尚就能走出好運嗎?");
  $('#as_2').html("您對數字語言也有特別的喜好嗎?");
  $('#as_3').html("您相信配戴「如意」真能招來好運嗎?");
}); 
   